//-----------------------------------------------------------------------------
// エクスポートされる関数の実装場所
//-----------------------------------------------------------------------------
#include "./kjmlib-20121228/kjmlib.h"

//-----------------------------------------------------------------------------
// ドライバがインストール済みかどうか調べる
// (kjm::odbcUtil::isInstalled 参照
//
// 
//-----------------------------------------------------------------------------
BOOL __stdcall kjm__odbcUtil__isInstalled(LPCTSTR driverName) {
	return (kjm::odbcUtil::isInstalled(driverName)) ? TRUE : FALSE;
}
