$header = <<EOS;
店舗番号,予\備,台数,台数(サンド現金),台数(サンドカード),台数(サンド券売),予\備,ｱｳﾄ,ｾｰﾌ,ｽﾀｰﾄ,特賞ｱｳﾄ,特賞ｾｰﾌ,特賞2ｱｳﾄ,特賞2ｾｰﾌ,特賞2ｽﾀｰﾄ,ﾍﾞｰｽ回数(特賞回数/打止回数),打止回数,特賞回数  (T),特賞1回数 (T1),特賞2回数 (T2),確変回数((T2)>T1>T2>T1･･),確変中T1回数,ﾗｯｷｰ回数,ﾗｯｷｰ中T1回数,ﾗｯｷｰ中MAXT1回数,ﾗｯｷｰ中ｱｳﾄ,ﾗｯｷｰ中ｾｰﾌ,ﾗｯｷｰT1間ｱｳﾄ,ﾗｯｷｰ中持玉,打込玉,特賞打込,積稼動数,客交代,発生済ﾌﾗｸﾞ,ﾄﾞｱ1回数,ﾄﾞｱ2回数,呼出1回数,呼出2回数,不正回数,台断線回数,異常回数,点検回数,現金1断線回数,現金2断線回数,ｶｰﾄﾞ断線回数,売上異常回数,売上情報ﾌﾗｸﾞ(台ﾃﾞｰﾀ参照),dmy,ｻﾝﾄﾞ現金1売上(円),ｻﾝﾄﾞ現金2売上(円),ｻﾝﾄﾞｶｰﾄﾞ売上(円),ｻﾝﾄﾞ発券売上(円),台売上(円),会員数,会員稼動数,会員特賞1回数 (T1),会員特賞回数 (T),会員確変回数,会員ﾗｯｷｰ回数,会員ｱｳﾄ,会員ｾｰﾌ,会員特賞ｱｳﾄ,会員特賞ｾｰﾌ,会員ｽﾀｰﾄ,会員売上(円),台ﾘﾌﾟﾚｲ個数,台ﾘﾌﾟﾚｲ手数料(個数),台貯玉個数,島外断線済ﾌﾗｸﾞ,売上金額(合計)(円),景品個数(合計),原価景品個数,島外現金1売上(円),島外現金2売上(円),島外ｶｰﾄﾞ売上(円),島外ﾘﾌﾟﾚｲ個数,島外ﾘﾌﾟﾚｲ手数料(個数),島外ﾌﾟﾚﾐｱﾑ個数,島外貯玉個数,金庫合計,ｻﾝﾄﾞ現金計,ｻﾝﾄﾞ金庫計,POS個数,原価POS個数,カード発行ﾌﾗｸﾞ,カード発行断線ﾌﾗｸﾞ,カード発行合計金額(円),カード発行1000円計(円),カード発行2000円計(円),カード発行3000円計(円),カード発行5000円計(円),カード発行10000円計(円),カード精算機合計,自販機計(円),その他計,台景品個数,ﾚｷﾞｭﾗｰ回数(ｽﾛｯﾄのみ),CT中ﾚｷﾞｭﾗｰ回数(ｽﾛｯﾄのみ),現稼動台数,現会員稼働台数,金庫発券売上(円)  金庫:表\示番号2=1xxxの合計,予\備
EOS

$template = "CCS5L8S10L6S7C10L5S6L25SSL10S4LC*";

open(FH, 'c:\mpc\bin\1\syu040116.bin') or die "can't open file: $!\n";

print $header;

$\ = "\n";
$, = ",";
while (read FH, $buf, 320) {
	print (unpack($template, $buf));
}

close FH;
