<%
'----------------------------------------------------------------------
' H1タグを表現するクラス
'
'[簡単な使い方]
' Dim objH1
' Set objH1 = New TagH1
' objP.ResponseWrite("簡単な使い方")
'----------------------------------------------------------------------
Class TagH1
	'------------------------------------------------------------------
	' すべての属性情報をクリアする
	'------------------------------------------------------------------
	Public Sub TagClear()
	End Sub
	
	'------------------------------------------------------------------
	' 開始タグ文字列を返す
	'------------------------------------------------------------------
	Public Function TagOpen()
		TagOpen = "<h1"
		TagOpen = TagOpen & ">"
	End Function
	
	'------------------------------------------------------------------
	' 終了タグ文字列を返す
	'------------------------------------------------------------------
	Public Function TagClose()
		TagClose = "</h1>"
	End Function
	
	'------------------------------------------------------------------
	' <tag>text</tag>という文字列を返す
	'------------------------------------------------------------------
	Public Function TagWrite(text)
		TagWrite = TagOpen() & text & TagClose()
	End Function
	
	'------------------------------------------------------------------
	' <tag>text</tag>という文字列をResponse.Writeで、ブラウザに返す
	'------------------------------------------------------------------
	Public Sub ResponseWrite(text)
		Response.Write(TagWrite(text))
	End Sub
End Class

'----------------------------------------------------------------------
' H2タグを表現するクラス
'
'[簡単な使い方]
' Dim objH2
' Set objH2 = New TagH2
' objP.ResponseWrite("簡単な使い方")
'----------------------------------------------------------------------
Class TagH2
	'------------------------------------------------------------------
	' すべての属性情報をクリアする
	'------------------------------------------------------------------
	Public Sub TagClear()
	End Sub
	
	'------------------------------------------------------------------
	' 開始タグ文字列を返す
	'------------------------------------------------------------------
	Public Function TagOpen()
		TagOpen = "<h2"
		TagOpen = TagOpen & ">"
	End Function
	
	'------------------------------------------------------------------
	' 終了タグ文字列を返す
	'------------------------------------------------------------------
	Public Function TagClose()
		TagClose = "</h2>"
	End Function
	
	'------------------------------------------------------------------
	' <tag>text</tag>という文字列を返す
	'------------------------------------------------------------------
	Public Function TagWrite(text)
		TagWrite = TagOpen() & text & TagClose()
	End Function
	
	'------------------------------------------------------------------
	' <tag>text</tag>という文字列をResponse.Writeで、ブラウザに返す
	'------------------------------------------------------------------
	Public Sub ResponseWrite(text)
		Response.Write(TagWrite(text))
	End Sub
End Class

'----------------------------------------------------------------------
' IMGタグを表現するクラス
'
'[簡単な使い方]
' Dim objImg
' Set objImg = New TagImg
' objImg.Src = "images/haikai-main02-noticebl.jpg"
' objImg.HSpace = 5
' objImg.Align = "texttop"
' objImg.ResponseWrite()
'----------------------------------------------------------------------
Class TagImg
	Private m_src		'src 属性
	Private m_hspace	'hspace 属性
	Private m_align		'align 属性
	
	'------------------------------------------------------------------
	' src属性の取得
	'------------------------------------------------------------------
	Public Property Get Src()
		Src = m_src
	End Property
	
	'------------------------------------------------------------------
	' src属性の設定
	'------------------------------------------------------------------
	Public Property Let Src(expr)
		m_src = expr
	End Property
	
	'------------------------------------------------------------------
	' hspace属性の取得
	'------------------------------------------------------------------
	Public Property Get HSpace()
		HSpace = m_hspace
	End Property
	
	'------------------------------------------------------------------
	' hspace属性の設定
	'------------------------------------------------------------------
	Public Property Let HSpace(expr)
		m_hspace = expr
	End Property
	
	'------------------------------------------------------------------
	' align属性の取得
	'------------------------------------------------------------------
	Public Property Get Align()
		Align = m_align
	End Property
	
	'------------------------------------------------------------------
	' align属性の設定
	'------------------------------------------------------------------
	Public Property Let Align(expr)
		m_align = expr
	End Property

	'------------------------------------------------------------------
	' すべての属性情報をクリアする
	'------------------------------------------------------------------
	Public Sub TagClear()
		m_src = ""
		m_hspace = ""
		m_align = ""
	End Sub
	
	'------------------------------------------------------------------
	' 開始タグ文字列を返す
	'------------------------------------------------------------------
	Public Function TagOpen()
		TagOpen = "<img"
		If m_src <> "" Then
			TagOpen = TagOpen & " src='" & m_src & "'"
		End If
		If m_hspace <> "" Then
			TagOpen = TagOpen & " hspace='" & m_hspace & "'"
		End If
		If m_align <> "" Then
			TagOpen = TagOpen & " align='" & m_align & "'"
		End If
		TagOpen = TagOpen & ">"
	End Function
	
	'------------------------------------------------------------------
	' 終了タグ文字列を返す
	'------------------------------------------------------------------
	Public Function TagClose()
		TagClose = ""
	End Function
	
	'------------------------------------------------------------------
	' <tag>text</tag>という文字列を返す
	'------------------------------------------------------------------
	Public Function TagWrite()
		TagWrite = TagOpen()
	End Function
	
	'------------------------------------------------------------------
	' <tag>text</tag>という文字列をResponse.Writeで、ブラウザに返す
	'------------------------------------------------------------------
	Public Sub ResponseWrite()
		Response.Write(TagWrite())
	End Sub
End Class

'----------------------------------------------------------------------
' Pタグを表現するクラス
'
'[簡単な使い方]
' Dim objP
' Set objP = New TagP
' objP.style = "padding: 0.5em; border: 1pt solid black; text-shadow:3px 3px 3px gray"
' objP.ResponseWrite("簡単な使い方")
'----------------------------------------------------------------------
Class TagP
	Private m_style		' style 属性
	
	'------------------------------------------------------------------
	' style属性の取得
	'------------------------------------------------------------------
	Public Property Get Style()
		Style = m_style
	End Property
	
	'------------------------------------------------------------------
	' style属性の設定
	'------------------------------------------------------------------
	Public Property Let Style(expr)
		m_style = expr
	End Property

	'------------------------------------------------------------------
	' すべての属性情報をクリアする
	'------------------------------------------------------------------
	Public Sub TagClear()
		m_style = ""
	End Sub
	
	'------------------------------------------------------------------
	' 開始タグ文字列を返す
	'------------------------------------------------------------------
	Public Function TagOpen()
		TagOpen = "<p"
		If m_style <> "" Then
			TagOpen = TagOpen & " style='" & m_style & "'"
		End If
		TagOpen = TagOpen & ">"
	End Function
	
	'------------------------------------------------------------------
	' 終了タグ文字列を返す
	'------------------------------------------------------------------
	Public Function TagClose()
		TagClose = "</p>"
	End Function
	
	'------------------------------------------------------------------
	' <tag>text</tag>という文字列を返す
	'------------------------------------------------------------------
	Public Function TagWrite(text)
		TagWrite = TagOpen() & text & TagClose()
	End Function
	
	'------------------------------------------------------------------
	' <tag>text</tag>という文字列をResponse.Writeで、ブラウザに返す
	'------------------------------------------------------------------
	Public Sub ResponseWrite(text)
		Response.Write(TagWrite(text))
	End Sub
End Class
%>
