//---------------------------------------------------------------------
// toolbox 内で汎用的な処理をまとめる
//---------------------------------------------------------------------


#include "toolbox.h"


//---------------------------------------------------------------------
// 指定ファイルのバックアップを一世代分残す。
//
// 指定されたファイルの拡張子を 000 にしたものが、バックアップファイル。
//---------------------------------------------------------------------
void BackupLog( const char* filename ) {

	struct _stat buffer;
	if ( _stat( filename, &buffer ) == 0 ) {

		// ファイルのサイズが 1M を超えたら、バックアップにする
		if ( buffer.st_size > 1 * 1024 * 1024 ) {

			kjm::path_string newname = kjm::path_string( filename ).RenameExtension( ".000" );

			// 古いバックアップを削除(あれば)
			remove( newname.c_str() );

			// バックアップファイルに名前を変える
			rename( filename, newname.c_str() );
		}
	}
}


