//---------------------------------------------------------------------
// ドライブの一覧を保持するクラス
//---------------------------------------------------------------------

#include "kjm_driveList.h"

//---------------------------------------------------------------------
// デフォルトコンストラクタ
//---------------------------------------------------------------------
kjm::driveList::driveList() {
	DWORD dwDrives = GetLogicalDrives();

	for (int i = 'A'; i <= 'Z'; i++) {
		if (dwDrives & (1 << (i - 'A'))) {
			m_driveList.push_back(kjm::drive(i - 'A'));
		}
	}
}

//---------------------------------------------------------------------
// 代入演算子
//---------------------------------------------------------------------
kjm::driveList& kjm::driveList::operator =(const kjm::driveList& rhs) {
	if (this == &rhs) return *this;

	m_driveList = rhs.m_driveList;

	return *this;
}
